df <- (read.csv("c://R/classification_test.csv",sep=",",header = TRUE)) #загрузка дата сета
n <- 4606                                                               #кол-во строк в дата сете
x <- runif(n) 
df$help <- x + rnorm(n, sd=0.1)                                         #случайное значение вспомогательной переменной для построения 
                                                                        #множественной регресси 
df$prediction <- ifelse((predict(lm( help~ ., data = df),newdata = df))>0.5,1,0) #создание переменной prediction + логика
write.csv(df$prediction,"c://R/sample_submission_3.xls",sep =",")       #создание файла csv 
write.csv(df$prediction,"c://R/sample_submission_3.txt",sep =",")       #создание файла txt

#------------------------------------------------------------------------------------------------------------------------------------
#в ходе выполнения скрипта возникла ошибка, которая не позволила задать разделитель для csv-файла.
#Warning message:
#In write.csv(df$prediction, "c://R/sample_submission_3.txt", sep = ",") :
#  попытка установить 'sep' пропущена
#------------------------------------------------------------------------------------------------------------------------------------
